clear
format compact

h = 0.005;

Tf1 = 0.08;
Tf2 = 0.08;

% =============================================
g  = 9.81e+00;
L1 = 9.20e-02;  % 9.2cm

a1 = 1.25e+01;
b1 = 3.42e+01;

a2 = 1.59e-01;
b2 = 2.41e-02;

E = [ 1  0  0  0
      0  1  0  0
      0  0  1  0
      0  L1 0  a2 ];
F = [ 0  1  0  0
      0 -a1 0  0
      0  0  0  1
      0  0  g -b2 ];
G = [ 0
      b1
      0
      0 ];

% =============================================
A = inv(E)*F
B = inv(E)*G
C = [ 1  0  0  0 ]

Ae = [ A  zeros(4,1)
      -C  zeros(1,1) ];
Be = [ B
       0 ];

q1 = 0;
q2 = 0;
q3 = 1;
q4 = 0;
qs = 4;

Qe = diag([q1 q2 q3 q4 qs])
Re = 1

Ke = - lqr(Ae,Be,Qe,Re);

K = Ke(1:4)
G = Ke(5)

disp('***** Ae + Be*Ke の固有値        *****')
disp('***** Ae = [ A  0    Be = [ B   *****')
disp('*****       -C  0 ],        0 ] *****')
disp('***** Ke = [ K  G ]             *****')
eigen = eig(Ae + Be*Ke)
